@Gerrit-K  I don’t think there is any typo error. Please find the below configuration and versions :

 azurerm version     = "3.26.0" 

Resource Example: 
 
 ```
resource "azurerm_resource_group" "sree-example" {
  name     = "example-resources"
  location = "Central US"
}

resource "azurerm_eventhub_namespace" "example" {
  name                = "sree-example-namespace"
  location            = azurerm_resource_group.sree-example.location
  resource_group_name = azurerm_resource_group.sree-example.name
  sku                 = "Standard"
  capacity            = 2

  network_rulesets {
    default_action                = "Deny"
    virtual_network_rule          = []
    ip_rule                       = []
    public_network_access_enabled = null
  }
}
```

Terraform plan :

```
  # azurerm_eventhub_namespace.example will be created
  + resource "azurerm_eventhub_namespace" "example" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 2
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "centralus"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = (known after apply)
      + name                                      = "sree-example-namespace"
      + network_rulesets                          = [
          + {
              + default_action                 = "Deny"
              + ip_rule                        = []
              + public_network_access_enabled  = true
              + trusted_service_access_enabled = null
              + virtual_network_rule           = null
            },
        ]
      + public_network_access_enabled             = true
      + resource_group_name                       = "example-resources"
      + sku                                       = "Standard"
      + zone_redundant                            = false
    }

  # azurerm_resource_group.sree-example will be created
  + resource "azurerm_resource_group" "sree-example" {
      + id       = (known after apply)
      + location = "centralus"
      + name     = "example-resources"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

Terraform apply 

```
azurerm_resource_group.sree-example: Creating...
azurerm_resource_group.sree-example: Creation complete after 1s [id=/subscriptions/xxxx/resourceGroups/example-resources]
azurerm_eventhub_namespace.example: Creating...
azurerm_eventhub_namespace.example: Still creating... [10s elapsed]
azurerm_eventhub_namespace.example: Still creating... [20s elapsed]
azurerm_eventhub_namespace.example: Still creating... [30s elapsed]
azurerm_eventhub_namespace.example: Still creating... [40s elapsed]
azurerm_eventhub_namespace.example: Still creating... [50s elapsed]
azurerm_eventhub_namespace.example: Still creating... [1m0s elapsed]
╷
│ Error: setting network ruleset properties for Namespace (Subscription: "xxxxxx"
│ Resource Group Name: "example-resources"
│ Namespace Name: "sree-example-namespace"): networkrulesets.NetworkRuleSetsClient#NamespacesCreateOrUpdateNetworkRuleSet: Failure responding to request: StatusCode=400 -- Original Error: autorest/azure: Service returned an error. Status=400 Code="BadRequest" Message="This update of networkRuleSets, sets zero IPRule and VirtualNetworkRules, and the DefaultAction is set to Deny. This would render the namespace resources inaccessible for data-plane requests. If the intention was to restrict data-plane requests to private links only, please set the PublicNetworkAccess property to Disabled. Else either set the DefaultAction property to Allow OR add some allowed IPRules or VirtualNetworkRules in the update request. CorrelationId: 417fb527-be6f-5ee5-7991-0abf28c98fcf"
│ 
│   with azurerm_eventhub_namespace.example,
│   on main.tf line 6, in resource "azurerm_eventhub_namespace" "example":
│    6: resource "azurerm_eventhub_namespace" "example" {
│ 
╵

```